_posts/2022-01-08-boj-17435.html
---
layout: post
title: BOJ 17435 합성함수와 쿼리
tags: SparseTable
---

<div id="outline-container-orgcd746c4" class="outline-2">
<h2 id="orgcd746c4">BOJ 17435 합성함수와 쿼리</h2>
</div>

<div id="outline-container-orga07ba02" class="outline-2">
<h2 id="orga07ba02">접근하기</h2>
<div class="outline-text-2" id="text-orga07ba02">
<ul class="org-ul">
<li>dp table을 구성해서 N번 이동해서 찾을 것을 Log2(N)번 이동해서 찾는 방식</li>
</ul>
<pre class="example">
5
3 3 5 4 3
5
1 1         1에서 1(2)만큼 이동
2 1         1에서 10(2)만큼 이동
11 3        3에서 1101(2)만큼 이동
1000 4      4에서 1111101000(2)만큼 이동
5 1         5에서 101(2)만큼 이동

dp[k][v] : v에서 k번 이동하면 나오는 번호
----------------
     1 3 3 5 4 3
     2 5 5 3 4 5
     4 5 5 3 4 5
     8 5 5 3 4 5
    16 5 5 3 4 5
    32 5 5 3 4 5
    64 5 5 3 4 5
   128 5 5 3 4 5
   256 5 5 3 4 5
   512 5 5 3 4 5
  1024 5 5 3 4 5
  2048 5 5 3 4 5
  4096 5 5 3 4 5
  8192 5 5 3 4 5
 16384 5 5 3 4 5
 32768 5 5 3 4 5
 65536 5 5 3 4 5
131072 5 5 3 4 5
262144 5 5 3 4 5
</pre>
</div>
</div>

<div id="outline-container-org084c811" class="outline-2">
<h2 id="org084c811">코드</h2>
<div class="outline-text-2" id="text-org084c811">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>

<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">LOG_SIZE</span> 18

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">M</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">next</span>[200020];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[LOG_SIZE+1][200020];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;M);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=M;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;next[i]);
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=M;i++) {
        dp[0][i] = next[i];
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">k</span>=1;k&lt;=LOG_SIZE;k++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=M;i++) {
            dp[k][i] = dp[k-1][dp[k-1][i]];
        }
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">k</span>=0;k&lt;=LOG_SIZE;k++) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%6lld "</span>, 1ULL&lt;&lt;k);
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=M;i++) {
            printf(<span style="color: #ad7fa8; font-style: italic;">"%d "</span>, dp[k][i]);
        }
        printf(<span style="color: #ad7fa8; font-style: italic;">"\n"</span>);
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">Q</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">X</span>;
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;Q);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;Q;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;X);
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=LOG_SIZE;j&gt;=0;j--) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (N &amp; (1&lt;&lt;j)) {
                X = dp[j][X];
            }
        }
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, X);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge63e168" class="outline-2">
<h2 id="orge63e168">문제 링크</h2>
<div class="outline-text-2" id="text-orge63e168">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/17435">https://www.acmicpc.net/problem/17435</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge3d37e1" class="outline-2">
<h2 id="orge3d37e1">풀이/해설참고</h2>
<div class="outline-text-2" id="text-orge3d37e1">
<ul class="org-ul">
<li><a href="https://namnamseo.tistory.com/entry/Sparse-Table">https://namnamseo.tistory.com/entry/Sparse-Table</a></li>
</ul>
</div>
</div>
